
## Plan Result




<pre><code>Plan: 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_container.data_extract_service_container
* Update
  * azurerm_resource_group.rg
  * module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.storage_account_rd_data_extract.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat"
        name     = "rd-aat"
      ~ tags     = {
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#referencedata"
          - "Team Name"           = "ReferenceData"
          - "application"         = "referencedata"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-11-02T10:28:39Z"
          - "managedBy"           = "ReferenceData"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_container.data_extract_service_container will be created
  + resource "azurerm_storage_container" "data_extract_service_container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "rd-data-extract"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "rddataextractaat"
    }

  # module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat|rd-aat"
        name                           = "rd-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage_account_rd_data_extract.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rddataextractaat"
        name                              = "rddataextractaat"
        tags                              = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#referencedata"
            "Team Name"           = "ReferenceData"
            "application"         = "referencedata"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "staging"
            "managedBy"           = "ReferenceData"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ virtual_network_subnet_ids = [
              + "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/rdo-hub-sftp-prod/providers/Microsoft.Network/virtualNetworks/rdo-sftp-vnet/subnets/rdo-sftp-private",
              + "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/rdo-hub-sftp-prod/providers/Microsoft.Network/virtualNetworks/rdo-sftp-vnet/subnets/rdo-sftp-public",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas",
              + "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00",
              + "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":199,"Program":"tfcmt","SHA1":"","Vars":{}} -->